Revit 2024 API
RoomTagType Class
An object that represents a Room Tag type.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class RoomTagType : FamilySymbol
Visual Basic
Public Class RoomTagType _
	Inherits FamilySymbol
Visual C++
public ref class RoomTagType : public FamilySymbol
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.Architecture.RoomTagType
See Also
RoomTagType Members
Autodesk.Revit.DB.Architecture Namespace